##
## Datapack Upgrader v1.0.0 by wifi_left
## If you encounter a problem, make an issue on https://github.com/wifi-left/Datapack-Upgrader
## 

tellraw @s ["\u00a76 ※ 黑白棋介绍\n\n\u00a7e\u00a7l棋规\n\n\u00a7f1．棋局开始时黑棋位于e4和d5，白棋位于d4和e5。（默认棋子）\n2．黑方先行，双方交替下棋。\n3．一步合法的棋步包括：在一个空格新落下一个棋子，并且翻转对手一个或多个棋子。\n4．新落下的棋子与棋盘上已有的同色棋子间，对方被夹住的所有棋子都要翻转过来。可以是横着夹，竖着夹，或是斜着夹。夹住的位置上必须全部是对手的棋子，不能有空格。\n5．一步棋可以在数个方向上翻棋，任何被夹住的棋子都必须被翻转过来，棋手无权选择不去翻某个棋子。\n6．除非至少翻转了对手的一个棋子，否则就不能落子。如果一方没有合法棋步，也就是说不管他下到哪里，都不能至少翻转对手的一个棋子，那他这一轮只能弃权，而由他的对手继续落子直到他有合法棋步可下。\n7．如果一方至少有一步合法棋步可下，他就必须落子，不得弃权。\n8．棋局持续下去，直到棋盘填满或者双方都无合法棋步可下。\n\n\u00a7a\u00a7b\u00a7l下子的方法\n\n\u00a7f把自己颜色的棋子放在棋盘的空格上，而当自己放下的棋子在横、竖、斜八个方向内有一个自己的棋子，则被夹在中间的全部翻转会成为自己的棋子。并且，只有在可以翻转棋子的地方才可以下子。\n"]

